In [13]:
import pandas as pd
import numpy as np

In [14]:
## A multyindexed series

In [7]:
index = [('Nairobi', 2000), ('Nairobi', 2010),
         ('Kisumu', 2000), ('NKisumu', 2010),
         ('Mombasa', 2000), ('Mombasa', 2010)]

populations = [3456789, 355678,
              18663456, 193456789,
             23456789, 25456789]

pop = pd.Series(populations, index=index)
pop

(Nairobi, 2000)      3456789
(Nairobi, 2010)       355678
(Kisumu, 2000)      18663456
(NKisumu, 2010)    193456789
(Mombasa, 2000)     23456789
(Mombasa, 2010)     25456789
dtype: int64

In [9]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('Nairobi', 2000),
            ('Nairobi', 2010),
            ( 'Kisumu', 2000),
            ('NKisumu', 2010),
            ('Mombasa', 2000),
            ('Mombasa', 2010)],
           )

In [10]:
pop = pop.reindex(index)
pop

Nairobi  2000      3456789
         2010       355678
Kisumu   2000     18663456
NKisumu  2010    193456789
Mombasa  2000     23456789
         2010     25456789
dtype: int64

In [11]:
pop[:, 2010]

Nairobi       355678
NKisumu    193456789
Mombasa     25456789
dtype: int64

In [15]:
## MultiIndex as extra dimension

In [17]:
pop_df = pop.unstack()
pop_df

               2000         2010
Kisumu   18663456.0          NaN
Mombasa  23456789.0   25456789.0
NKisumu         NaN  193456789.0
Nairobi   3456789.0     355678.0

In [20]:
pop_df.stack()

Kisumu   2000     18663456.0
Mombasa  2000     23456789.0
         2010     25456789.0
NKisumu  2010    193456789.0
Nairobi  2000      3456789.0
         2010       355678.0
dtype: float64

In [22]:
pop_df = pd.DataFrame({'total' : pop,
                    'under18' : [926089, 9284094,
                                 454325, 5454443,
                                 4235434, 5453243]})
pop_df

                  total  under18
Nairobi 2000    3456789   926089
        2010     355678  9284094
Kisumu  2000   18663456   454325
NKisumu 2010  193456789  5454443
Mombasa 2000   23456789  4235434
        2010   25456789  5453243

In [24]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

             2000       2010
Kisumu   0.024343        NaN
Mombasa  0.180563   0.214216
NKisumu       NaN   0.028195
Nairobi  0.267904  26.102525